import dedent from 'ts-dedent';

import {MarkdownSnippetStory, getSnippetMeta} from '../../fixtures/utils/storyMeta';

export default {...getSnippetMeta(), title: 'Builtins/table/Basic'};

export const Base: MarkdownSnippetStory = {
    name: 'Base',
    args: {
        snippet: dedent`
| Заголовок1  | Заголовок2  |
| ----------- | ----------- |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
| Текст       | Текст       |
`,
    },
};
